set_device -family {PolarFireSoC} -die {MPFS250T_ES} -speed {STD} -range {EXT}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\CLK_DIV\CLK_DIV_0\CLK_DIV_CLK_DIV_0_PF_CLK_DIV.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\CLK_DIV\CLK_DIV.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\CORERESET\CORERESET_0\core\corereset_pf.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\CORERESET\CORERESET.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\GLITCHLESS_MUX\GLITCHLESS_MUX_0\GLITCHLESS_MUX_GLITCHLESS_MUX_0_PF_NGMUX.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\GLITCHLESS_MUX\GLITCHLESS_MUX.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\INIT_MONITOR\INIT_MONITOR_0\INIT_MONITOR_INIT_MONITOR_0_PFSOC_INIT_MONITOR.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\INIT_MONITOR\INIT_MONITOR.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\OSCILLATOR_160MHz\OSCILLATOR_160MHz_0\OSCILLATOR_160MHz_OSCILLATOR_160MHz_0_PF_OSC.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\OSCILLATOR_160MHz\OSCILLATOR_160MHz.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\PCIE_REF_CLK\PCIE_REF_CLK_0\PCIE_REF_CLK_PCIE_REF_CLK_0_PF_XCVR_REF_CLK.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\PCIE_REF_CLK\PCIE_REF_CLK.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\PF_CCC_C0\PF_CCC_C0_0\PF_CCC_C0_PF_CCC_C0_0_PF_CCC.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\PF_CCC_C0\PF_CCC_C0.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\TRANSMIT_PLL\TRANSMIT_PLL_0\TRANSMIT_PLL_TRANSMIT_PLL_0_PF_TX_PLL.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\TRANSMIT_PLL\TRANSMIT_PLL.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\CLOCKS_AND_RESETS\CLOCKS_AND_RESETS.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_axi4_lite_target_ctrl.v}
 add_include_path  {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_axi4_stream_target_ctrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_ctrl_if_mux_cdc.v}
 add_include_path  {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_axi4_initiator_ctrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\DMA_CONTROLLER_DMA_CONTROLLER_0_SRAM_cache.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\DMA_CONTROLLER_DMA_CONTROLLER_0_ram_cache.v}
 add_include_path  {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_cache.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_round_robin_arbiter_w_ack.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_dma_start_ctrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_int_status_mux.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_round_robin_arbiter.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_fixed_priority_arbiter.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\DMA_CONTROLLER_DMA_CONTROLLER_0_SRAM_dscCacheM.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\DMA_CONTROLLER_DMA_CONTROLLER_0_ram_dscCacheM.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\DMA_CONTROLLER_DMA_CONTROLLER_0_SRAM_dscCacheNM.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\DMA_CONTROLLER_DMA_CONTROLLER_0_ram_dscCacheNM.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\DMA_CONTROLLER_DMA_CONTROLLER_0_SRAM_dscConCacheNM.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\DMA_CONTROLLER_DMA_CONTROLLER_0_ram_dscConCacheNM.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_int_ext_dscrptr_cache.v}
 add_include_path  {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0}
 add_include_path  {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_dma_arbiter.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_int_error_ctrl_fsm.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_rd_tran_ctrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_rd_tran_queue.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_trans_ack.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_wr_tran_ctrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_wr_tran_queue.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_dma_tran_ctrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_dscrptr_src_mux.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_ext_dscrptr_fetch_fsm.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_dma_controller.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\DMA_CONTROLLER_DMA_CONTROLLER_0_SRAM_bd.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\DMA_CONTROLLER_DMA_CONTROLLER_0_ram_bd.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_ram_1k20_wrapper.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_buffer_descriptors.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_control_registers.v}
 add_include_path  {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\CoreAXI4DMAController_int_1_ControllerFIFO.v}
 add_include_path  {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\CoreAXI4DMAController_int_2_ControllerFIFO.v}
 add_include_path  {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\CoreAXI4DMAController_int_3_ControllerFIFO.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\DMA_CONTROLLER_DMA_CONTROLLER_0_SRAM_fifo_0.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\DMA_CONTROLLER_DMA_CONTROLLER_0_ram_fifo_0.v}
 add_include_path  {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\CoreAXI4DMAController_int_0_ControllerFIFO.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_int_x_ctrl.v}
 add_include_path  {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0}
 add_include_path  {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller_int_controller.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER_0\rtl\vlog\core\coreaxi4dmacontroller.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_CONTROLLER\DMA_CONTROLLER.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\ResetSycnc.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\MasterAddressDecoder.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\DependenceChecker.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\BitScan0.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\TransactionController.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\MasterControl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\RoundRobinArb.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\TargetMuxController.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\AddressController.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\Revision.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\DERR_Slave.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\DualPort_FF_SyncWr_SyncRd.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\DualPort_Ram_SyncWr_SyncRd.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\RdFifoDualPort.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\ReadDataMux.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\RequestQual.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\ReadDataController.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\RDataController.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\SlaveDataMuxController.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\RespController.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\FifoDualPort.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\WriteDataMux.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\WDataController.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\Axi4CrossBar.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\AHBL_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\AXI4_Read_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\AXI4_Write_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\AHB_SM.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\MstrAHBtoAXI4Converter.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\Bin2Gray.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\CDC_grayCodeCounter.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\CDC_rdCtrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\CDC_wrCtrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\RAM_BLOCK.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\CDC_FIFO.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\MstrClockDomainCrossing.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_CmdFifoWriteCtrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\Hold_Reg_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_Hold_Reg_Rd.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_preCalcCmdFifoWrCtrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_widthConvrd.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\FIFO_CTRL.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\FIFO.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\byte2bit.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_readWidthConv.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_Hold_Reg_Wr.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_widthConvwr.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_brespCtrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_writeWidthConv.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DownConverter.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_AChannel.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_BChannel.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_RChannel_SlvRid_Arb.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_RChan_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_preCalcRChan_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\FIFO_downsizing.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_RChannel.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_WChan_Hold_Reg.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_WChan_ReadDataFifoCtrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_Wchan_WriteDataFifoCtrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\FIFO_upsizing.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_WChannel.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_preCalcAChannel.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\UpConverter.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\MstrDataWidthConv.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\MstrProtocolConverter.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\RegSliceFull.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\RegisterSlice.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\MasterConvertor.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvClockDomainCrossing.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvDataWidthConverter.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvAxi4ProtConvRead.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvAxi4ProtConvWrite.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvAxi4ProtocolConv.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvAxi4ProtConvAXI4ID.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvProtocolConverter.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlaveConvertor.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\CoreAxi4Interconnect.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_INITIATOR\DMA_INITIATOR.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\FIC0_INITIATOR\FIC0_INITIATOR.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\MSS_LSRAM\PF_TPSRAM_AHB_AXI_0\MSS_LSRAM_PF_TPSRAM_AHB_AXI_0_PF_TPSRAM.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\MSS_LSRAM\COREAXI4SRAM_0\rtl\vlog\core\CoreAXI4SRAM_MAINCTRL_ECC.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\MSS_LSRAM\COREAXI4SRAM_0\rtl\vlog\core\CoreAXI4SRAM_MAINCTRL.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\MSS_LSRAM\COREAXI4SRAM_0\rtl\vlog\core\CoreAXI4SRAM_SLVIF.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\MSS_LSRAM\COREAXI4SRAM_0\rtl\vlog\core\CoreAXI4SRAM.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\MSS_LSRAM\MSS_LSRAM.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\FIC_0_PERIPHERALS\FIC_0_PERIPHERALS.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\hdl\AXI4_address_shim.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\FIC_1_INITIATOR\FIC_1_INITIATOR.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\PCIE_INITIATOR\PCIE_INITIATOR.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\SgCore\PF_PCIE\2.0.121\g5_apblink_master.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\PF_PCIE_C0\PF_PCIE_C0_0\PF_PCIE_C0_PF_PCIE_C0_0_PF_PCIE.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\PF_PCIE_C0\PF_PCIE_C0.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\FIC_1_PERIPHERALS\FIC_1_PERIPHERALS.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\COREI2C\7.2.101\rtl\vlog\core\corei2creal.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\COREI2C_C0\COREI2C_C0_0\rtl\vlog\core\corei2c.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\COREI2C_C0\COREI2C_C0.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\CORE_I2C_C0_0_WRAPPER\CORE_I2C_C0_0_WRAPPER.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\CoreUARTapb_C0\CoreUARTapb_C0_0\rtl\vlog\core\Clock_gen.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\CoreUARTapb_C0\CoreUARTapb_C0_0\rtl\vlog\core\fifo_256x8_g5.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\CoreUARTapb_C0\CoreUARTapb_C0_0\rtl\vlog\core\Rx_async.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\CoreUARTapb_C0\CoreUARTapb_C0_0\rtl\vlog\core\Tx_async.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\CoreUARTapb_C0\CoreUARTapb_C0_0\rtl\vlog\core\CoreUART.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\CoreUARTapb_C0\CoreUARTapb_C0_0\rtl\vlog\core\CoreUARTapb.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\CoreUARTapb_C0\CoreUARTapb_C0.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\hdl\apb_arbiter.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\hdl\APB_PASS_THROUGH.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\CoreAPB3\4.2.100\rtl\vlog\core\coreapb3_muxptob3.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\CoreAPB3\4.2.100\rtl\vlog\core\coreapb3_iaddr_reg.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\CoreAPB3\4.2.100\rtl\vlog\core\coreapb3.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\FIC_3_0x4000_0xxx\FIC_3_0x4000_0xxx.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\FIC_3_0x4FFF_Fxxx\FIC_3_0x4FFF_Fxxx.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\FIC_3_0x4xxx_xxxx\FIC_3_0x4xxx_xxxx.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\FIC_3_ADDRESS_GENERATION\FIC_3_ADDRESS_GENERATION.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\GPIO\GPIO_0\rtl\vlog\core\coregpio.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\GPIO\GPIO.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\IHC_APB\IHC_APB.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\hdl\miv_ihcia.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\hdl\miv_ihcc_mem.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\hdl\miv_ihcc_irqs.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\hdl\miv_ihcc_ctrl.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\hdl\miv_ihcc.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\IHC_SUBSYSTEM\IHC_SUBSYSTEM.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\RECONFIGURATION_INTERFACE\RECONFIGURATION_INTERFACE_0\RECONFIGURATION_INTERFACE_RECONFIGURATION_INTERFACE_0_PF_DRI.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\RECONFIGURATION_INTERFACE\RECONFIGURATION_INTERFACE.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\corepwm\4.5.100\rtl\vlog\core\tach_if.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\corepwm\4.5.100\rtl\vlog\core\pwm_gen.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\corepwm\4.5.100\rtl\vlog\core\reg_if.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\corepwm\4.5.100\rtl\vlog\core\timebase.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\Actel\DirectCore\corepwm\4.5.100\rtl\vlog\core\corepwm.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\corepwm_C0\corepwm_C0.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\hdl\fabric_sd_emmc_demux_select.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\FIC_3_PERIPHERALS\FIC_3_PERIPHERALS.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\ICICLE_MSS\ICICLE_MSS.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\MSS_WRAPPER\MSS_WRAPPER.v}
read_verilog -mode system_verilog {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\MPFS_ICICLE_KIT_BASE_DESIGN\MPFS_ICICLE_KIT_BASE_DESIGN.v}
set_top_level {MPFS_ICICLE_KIT_BASE_DESIGN}
read_sdc -component {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\CLK_DIV\CLK_DIV_0\CLK_DIV_CLK_DIV_0_PF_CLK_DIV.sdc}
read_sdc -component {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\DMA_INITIATOR\DMA_INITIATOR_0\DMA_INITIATOR.sdc}
read_sdc -component {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\FIC0_INITIATOR\FIC0_INITIATOR_0\FIC0_INITIATOR.sdc}
read_sdc -component {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\FIC_1_INITIATOR\FIC_1_INITIATOR_0\FIC_1_INITIATOR.sdc}
read_sdc -component {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\ICICLE_MSS\ICICLE_MSS.sdc}
read_sdc -component {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\PCIE_INITIATOR\PCIE_INITIATOR_0\PCIE_INITIATOR.sdc}
read_sdc -component {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\PF_CCC_C0\PF_CCC_C0_0\PF_CCC_C0_PF_CCC_C0_0_PF_CCC.sdc}
read_sdc -component {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\PF_PCIE_C0\PF_PCIE_C0_0\PF_PCIE_C0_PF_PCIE_C0_0_PF_PCIE.sdc}
read_sdc -component {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\component\work\TRANSMIT_PLL\TRANSMIT_PLL_0\TRANSMIT_PLL_TRANSMIT_PLL_0_PF_TX_PLL.sdc}
derive_constraints
write_sdc {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\constraint\MPFS_ICICLE_KIT_BASE_DESIGN_derived_constraints.sdc}
write_ndc {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\constraint\MPFS_ICICLE_KIT_BASE_DESIGN_derived_constraints.ndc}
write_pdc {C:\Users\anana\Documents\JPL\Interrupts\icicle-kit-reference-design-master\MPFS_ICICLE\constraint\fp\MPFS_ICICLE_KIT_BASE_DESIGN_derived_constraints.pdc}
